SCRUM-1 Update: fix some bugs and clusters UML
